src/Enums/ТипыНалогов/ТипыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогов</name>
  <enumValues>
    <name>ЕдиныйНалоговыйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_РегиональныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_ФедеральныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДС_ВвозимыеТовары</name>
  </enumValues>
  <enumValues>
    <name>НДС_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>УСН_Доходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_ДоходыМинусРасходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_МинимальныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
  <enumValues>
    <name>ПФРСтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифЛЭ</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифШахтеры</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФССНС</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ПФРДоПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДС_ОбратноеОбложение</name>
  </enumValues>
  <enumValues>
    <name>АУСН</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ОПСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОМСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОССИностранныхРаботников</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ЕдиныйНалоговыйСчетПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ВидыНалоговУплачиваемыеОтдельно(Период) Экспорт
	
	ТипыНалогов = Новый Массив;
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ЕдиныйНалоговыйПлатеж);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ФССНС);
	Если Период >= ЕдиныйНалоговыйСчет.ДатаВыделенияДополнительныхВзносовЛетчиковИШахтеровИзСоставаЕНП() Тогда
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРДополнительныйТарифШахтеры);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРДополнительныйТарифЛЭ);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

//++ НЕ УТ

Функция ОбслуживаемыеСчетаУчетаНалогов() Экспорт
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	
	СчетаУчетаНалогов = БухгалтерскийУчет.СформироватьМассивСубсчетов(МассивСчетов);
	
	СчетаИсключения = Новый Массив;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ЕдиныйНалоговыйСчет); // 68.90
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, БухгалтерскийУчет.СформироватьМассивСубсчетов(СчетаИсключения), Истина);
	
	ЗапретИспользованияСчетовУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СчетаУчетаНалогов, "ЗапретитьИспользоватьВПроводках");
	Для Каждого СчетУчета Из СчетаУчетаНалогов Цикл
		Если ЗапретИспользованияСчетовУчета.Получить(СчетУчета) = Истина Тогда
			СчетаИсключения.Добавить(СчетУчета);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.РазностьМассивов(СчетаУчетаНалогов, СчетаИсключения);
	
КонецФункции

Функция ОбслуживаемыеСчетаУчетаСтраховыхВзносов(Период) Экспорт
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	
	СчетаУчетаСтраховыхВзносов = БухгалтерскийУчет.СформироватьМассивСубсчетов(МассивСчетов);
	
	СчетаИсключения = Новый Массив;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ);        // 69.11
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ФСС_СтраховойГод); // 69.06.4
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПФР_ДОБР_орг);     // 69.05.1
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПФР_ДОБР_сотр);    // 69.05.2
	Если Период >= ЕдиныйНалоговыйСчет.ДатаВыделенияДополнительныхВзносовЛетчиковИШахтеровИзСоставаЕНП() Тогда
		СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПФР_доп);         // 69.02.3
		СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПФР_доп_шахтеры); // 69.02.4
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, БухгалтерскийУчет.СформироватьМассивСубсчетов(СчетаИсключения), Истина);
	
	ЗапретИспользованияСчетовУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СчетаУчетаСтраховыхВзносов, "ЗапретитьИспользоватьВПроводках");
	Для Каждого СчетУчета Из СчетаУчетаСтраховыхВзносов Цикл
		Если ЗапретИспользованияСчетовУчета.Получить(СчетУчета) = Истина Тогда
			СчетаИсключения.Добавить(СчетУчета);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.РазностьМассивов(СчетаУчетаСтраховыхВзносов, СчетаИсключения);
	
КонецФункции

Функция ВидыНалоговУплачиваемыеБезУведомлений() Экспорт
	
	ТипыНалогов = Новый Массив;
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.АУСН);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ЕНВД);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДС);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДС_ВвозимыеТовары);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаПрибыль_РегиональныйБюджет);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаПрибыль_ФедеральныйБюджет);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ТорговыйСбор);
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция НалогиУплачиваемыеПоквартально() Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// УСН
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.УСН_Доходы);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.УСН_ДоходыМинусРасходы);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.УСН_МинимальныйНалог);
	
	// ЕСХН
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ЕСХН);
	
	// Прибыль
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаПрибыль_РегиональныйБюджет);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаПрибыль_ФедеральныйБюджет);
	
	// Имущественные налоги
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыНалогов, ВидыНалоговНаИмущество());
	
	// НДФЛ ИП
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыНалогов, ВидыНалоговНДФЛПредпринимателя());
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция НалогиУплачиваемыеЕжемесячно() Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// Прибыль агента
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаПрибыль_НалоговыйАгент);
	
	// Страховые взносы
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРНакопительнаяЧасть);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРСтраховаяЧасть);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ФФОМС);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.СтраховыеВзносыЕдиныйТариф);
	
	// Иностранцы
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ОПСИностранныхРаботников);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ОМСИностранныхРаботников);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ОССИностранныхРаботников);
	
	// НДФЛ агента
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыНалогов, ВидыНалоговНДФЛНалоговогоАгента());
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция ВсеВидыНалоговНДФЛ() Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// Дополним НДФЛ агента
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыНалогов, ВидыНалоговНДФЛНалоговогоАгента());
	
	// Дополним НДФЛ предпринимателя
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ТипыНалогов, ВидыНалоговНДФЛПредпринимателя());
	
	// Вернем весь НДФЛ
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция ВидыНалоговНДФЛНалоговогоАгента() Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// НДФЛ налогового агента
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛ);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДивиденды);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДивидендыСотрудникам);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДоначисленныйПоРезультатамПроверки);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДоходыКонтрагентов);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛПрочиеРасчетыСПерсоналом);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛСПревышения);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДивидендыСПревышения);
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция ВидыНалоговНДФЛПредпринимателя() Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// НДФЛ предпринимателя
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛ_ИП);
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция ВидыНалоговНаИмущество() Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// Имущество
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаИмущество);
	
	// Транспорт
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ТранспортныйНалог);
	
	// Земля
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ЗемельныйНалог);
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция ВидыНалоговСтраховыеВзносы() Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// ПФР - кроме добровольных
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРСтраховаяЧасть);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРНакопительнаяЧасть);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРДополнительныйТарифЛЭ);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРДополнительныйТарифШахтеры);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	
	// ФСС - кроме НС и ПЗ и фиксированных взносов
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ФСС);
	
	// ФФОМС
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ФФОМС);
	
	// Единый тариф
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.СтраховыеВзносыЕдиныйТариф);
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция ВидыНалоговУстаревшие(Период) Экспорт
	
	ТипыНалогов = Новый Массив;
	
	// УчетСтраховыхВзносовКлиентСервер.ДатаОтменыТФОМС
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ТФОМС);
	
	// УчетСтраховыхВзносовКлиентСервер.ДатаВыделенияВзносовНаОПСсСуммПревышенияПредельнойВеличины
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРПоСуммарномуТарифу);
	
	Если Период >= '2023-01-01' Тогда
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ФСС);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРНакопительнаяЧасть);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.УСН_МинимальныйНалог);
	КонецЕсли;
	
	Если Период >= '2024-01-01' Тогда
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРСтраховаяЧасть);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ФФОМС);
	КонецЕсли;
	
	Если Период >= '2025-01-01' Тогда
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛСПревышения);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДивиденды);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДивидендыСотрудникам);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДивидендыСПревышения);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛПрочиеРасчетыСПерсоналом);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДоходыКонтрагентов);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛДоначисленныйПоРезультатамПроверки);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции

Функция КБКПоТипамНалогов(Период) Экспорт
	Возврат Новый ФиксированноеСоответствие(Документы.УведомлениеОбИсчисленныхСуммахНалогов.КБКПоТипамНалогов(Период));
КонецФункции

Функция ВидыНалоговНаПрибыль() Экспорт
	
	ВидыНалогов = Новый Массив;
	
	ВидыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаПрибыль_РегиональныйБюджет);
	ВидыНалогов.Добавить(Перечисления.ТипыНалогов.НалогНаПрибыль_ФедеральныйБюджет);
	
	Возврат Новый ФиксированныйМассив(ВидыНалогов);
	
КонецФункции

//-- НЕ УТ

#КонецОбласти
